# Table of Content
01. Import Libraries
02. Import Data
03. Change Column Data Type (if necessary)
04. Find Mixed-Type Data
05. Data Accuracy
06. Data Consistency
07. Data Duplicates
08. Missing Values
09. Export Data

# 01. Import Libraries

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

In [2]:
# Adjust the setting to view all rows
pd.options.display.max_rows = None

In [3]:
# Adjust the setting to view all columns
pd.options.display.max_columns = None

# 02. Import Data

In [4]:
# Define the main project folder path
path = r'C:\Users\saich\Desktop\CareerFoundry\Data Immersion\Achievement 6 Advanced Analytics & Dashboard Design\11-2023 HDB Flat Resale Analysis'

### 02.1 Import Flat Resale Data: Jan 1990 ~ Dec 1999

In [5]:
# Import flat resale data from Jan 1990 to Dec 1999
flat_resale_90_99 = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'Flat Resale Data', 'flat_resale_90_99.csv'))

In [6]:
flat_resale_90_99.head()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price
0,1990-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,10 TO 12,31.0,IMPROVED,1977,9000
1,1990-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,04 TO 06,31.0,IMPROVED,1977,6000
2,1990-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,10 TO 12,31.0,IMPROVED,1977,8000
3,1990-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,07 TO 09,31.0,IMPROVED,1977,6000
4,1990-01,ANG MO KIO,3 ROOM,216,ANG MO KIO AVE 1,04 TO 06,73.0,NEW GENERATION,1976,47200

In [7]:
flat_resale_90_99.shape

(287196, 10)

### 02.2 Import Flat Resale Data: Jan 2000 ~ Feb 2012

In [8]:
# Import flat resale data from Jan 2000 to Feb 2012
flat_resale_00_12 = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'Flat Resale Data', 'flat_resale_00_12.csv'))

In [9]:
flat_resale_00_12.head()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price
0,2000-01,ANG MO KIO,3 ROOM,170,ANG MO KIO AVE 4,07 TO 09,69.0,Improved,1986,147000.0
1,2000-01,ANG MO KIO,3 ROOM,174,ANG MO KIO AVE 4,04 TO 06,61.0,Improved,1986,144000.0
2,2000-01,ANG MO KIO,3 ROOM,216,ANG MO KIO AVE 1,07 TO 09,73.0,New Generation,1976,159000.0
3,2000-01,ANG MO KIO,3 ROOM,215,ANG MO KIO AVE 1,07 TO 09,73.0,New Generation,1976,167000.0
4,2000-01,ANG MO KIO,3 ROOM,218,ANG MO KIO AVE 1,07 TO 09,67.0,New Generation,1976,163000.0

In [10]:
flat_resale_00_12.shape

(369651, 10)

### 02.3 Import Flat Resale Data: Mar 2012 ~ Dec 2014

In [11]:
# Import flat resale data from Mar 2012 to Dec 2014
flat_resale_12_14 = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'Flat Resale Data', 'flat_resale_12_14.csv'))

In [12]:
flat_resale_12_14.head()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price
0,2012-03,ANG MO KIO,2 ROOM,172,ANG MO KIO AVE 4,06 TO 10,45.0,Improved,1986,250000.0
1,2012-03,ANG MO KIO,2 ROOM,510,ANG MO KIO AVE 8,01 TO 05,44.0,Improved,1980,265000.0
2,2012-03,ANG MO KIO,3 ROOM,610,ANG MO KIO AVE 4,06 TO 10,68.0,New Generation,1980,315000.0
3,2012-03,ANG MO KIO,3 ROOM,474,ANG MO KIO AVE 10,01 TO 05,67.0,New Generation,1984,320000.0
4,2012-03,ANG MO KIO,3 ROOM,604,ANG MO KIO AVE 5,06 TO 10,67.0,New Generation,1980,321000.0

In [13]:
flat_resale_12_14.shape

(52203, 10)

### 02.4 Import Flat Resale Data: Jan 2015 ~ Dec 2016

In [14]:
# Import flat resale data from Jan 2015 to Dec 2016
flat_resale_15_16 = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'Flat Resale Data', 'flat_resale_15_16.csv'))

In [15]:
flat_resale_15_16.head()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,remaining_lease,resale_price
0,2015-01,ANG MO KIO,3 ROOM,174,ANG MO KIO AVE 4,07 TO 09,60.0,Improved,1986,70,255000.0
1,2015-01,ANG MO KIO,3 ROOM,541,ANG MO KIO AVE 10,01 TO 03,68.0,New Generation,1981,65,275000.0
2,2015-01,ANG MO KIO,3 ROOM,163,ANG MO KIO AVE 4,01 TO 03,69.0,New Generation,1980,64,285000.0
3,2015-01,ANG MO KIO,3 ROOM,446,ANG MO KIO AVE 10,01 TO 03,68.0,New Generation,1979,63,290000.0
4,2015-01,ANG MO KIO,3 ROOM,557,ANG MO KIO AVE 10,07 TO 09,68.0,New Generation,1980,64,290000.0

In [16]:
flat_resale_15_16.shape

(37153, 11)

### 02.5 Import Flat Resale Data: Jan 2017 ~ Dec 2023

In [17]:
# Import flat resale data from Jan 2017 to Dec 2023
flat_resale_17_23 = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'Flat Resale Data', 'flat_resale_17_23.csv'))

In [18]:
flat_resale_17_23.head()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,remaining_lease,resale_price
0,2017-01,ANG MO KIO,2 ROOM,406,ANG MO KIO AVE 10,10 TO 12,44.0,Improved,1979,61 years 04 months,232000.0
1,2017-01,ANG MO KIO,3 ROOM,108,ANG MO KIO AVE 4,01 TO 03,67.0,New Generation,1978,60 years 07 months,250000.0
2,2017-01,ANG MO KIO,3 ROOM,602,ANG MO KIO AVE 5,01 TO 03,67.0,New Generation,1980,62 years 05 months,262000.0
3,2017-01,ANG MO KIO,3 ROOM,465,ANG MO KIO AVE 10,04 TO 06,68.0,New Generation,1980,62 years 01 month,265000.0
4,2017-01,ANG MO KIO,3 ROOM,601,ANG MO KIO AVE 5,01 TO 03,67.0,New Generation,1980,62 years 05 months,265000.0

In [19]:
flat_resale_17_23.shape

(169168, 11)

# 03. Change Column Data Type (if necessary)

'month' column stores date information. It should be changed into datetime data type.

### 03.1 Flat Resale Data: Jan 1990 ~ Dec 1999

In [20]:
flat_resale_90_99.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 287196 entries, 0 to 287195
Data columns (total 10 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   month                287196 non-null  object
 1   town                 287196 non-null  object
 2   flat_type            287196 non-null  object
 3   block                287196 non-null  object
 4   street_name          287196 non-null  object
 5   storey_range         287196 non-null  object
 6   floor_area_sqm       287196 non-null  float64
 7   flat_model           287196 non-null  object
 8   lease_commence_date  287196 non-null  int64
 9   resale_price         287196 non-null  int64
dtypes: float64(1), int64(2), object(7)
memory usage: 21.9+ MB

In [21]:
# Change 'month' column into datetime
flat_resale_90_99['month'] = pd.to_datetime(flat_resale_90_99['month'])

In [22]:
# Verify the changes
flat_resale_90_99['month'].dtype

dtype('<M8[ns]')

### 03.2 Flat Resale Data: Jan 2000 ~ Feb 2012

In [23]:
flat_resale_00_12.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 369651 entries, 0 to 369650
Data columns (total 10 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   month                369651 non-null  object
 1   town                 369651 non-null  object
 2   flat_type            369651 non-null  object
 3   block                369651 non-null  object
 4   street_name          369651 non-null  object
 5   storey_range         369651 non-null  object
 6   floor_area_sqm       369651 non-null  float64
 7   flat_model           369651 non-null  object
 8   lease_commence_date  369651 non-null  int64
 9   resale_price         369651 non-null  float64
dtypes: float64(2), int64(1), object(7)
memory usage: 28.2+ MB

In [24]:
# Change 'month' column into datetime
flat_resale_00_12['month'] = pd.to_datetime(flat_resale_00_12['month'])

In [25]:
# Verify the changes
flat_resale_00_12['month'].dtype

dtype('<M8[ns]')

### 03.3 Flat Resale Data: Mar 2012 ~ Dec 2014

In [26]:
flat_resale_12_14.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52203 entries, 0 to 52202
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   month                52203 non-null  object
 1   town                 52203 non-null  object
 2   flat_type            52203 non-null  object
 3   block                52203 non-null  object
 4   street_name          52203 non-null  object
 5   storey_range         52203 non-null  object
 6   floor_area_sqm       52203 non-null  float64
 7   flat_model           52203 non-null  object
 8   lease_commence_date  52203 non-null  int64
 9   resale_price         52203 non-null  float64
dtypes: float64(2), int64(1), object(7)
memory usage: 4.0+ MB

In [27]:
# Change 'month' column into datetime
flat_resale_12_14['month'] = pd.to_datetime(flat_resale_12_14['month'])

In [28]:
# Verify the changes
flat_resale_12_14['month'].dtype

dtype('<M8[ns]')

### 03.4 Flat Resale Data: Jan 2015 ~ Dec 2016

In [29]:
flat_resale_15_16.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 37153 entries, 0 to 37152
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   month                37153 non-null  object
 1   town                 37153 non-null  object
 2   flat_type            37153 non-null  object
 3   block                37153 non-null  object
 4   street_name          37153 non-null  object
 5   storey_range         37153 non-null  object
 6   floor_area_sqm       37153 non-null  float64
 7   flat_model           37153 non-null  object
 8   lease_commence_date  37153 non-null  int64
 9   remaining_lease      37153 non-null  int64
 10  resale_price         37153 non-null  float64
dtypes: float64(2), int64(2), object(7)
memory usage: 3.1+ MB

In [30]:
# Change 'month' column into datetime
flat_resale_15_16['month'] = pd.to_datetime(flat_resale_15_16['month'])

In [31]:
# Verify the changes
flat_resale_15_16['month'].dtype

dtype('<M8[ns]')

### 03.5 Flat Resale Data: Jan 2017 ~ Dec 2023

In [32]:
flat_resale_17_23.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169168 entries, 0 to 169167
Data columns (total 11 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   month                169168 non-null  object
 1   town                 169168 non-null  object
 2   flat_type            169168 non-null  object
 3   block                169168 non-null  object
 4   street_name          169168 non-null  object
 5   storey_range         169168 non-null  object
 6   floor_area_sqm       169168 non-null  float64
 7   flat_model           169168 non-null  object
 8   lease_commence_date  169168 non-null  int64
 9   remaining_lease      169168 non-null  object
 10  resale_price         169168 non-null  float64
dtypes: float64(2), int64(1), object(8)
memory usage: 14.2+ MB

In [33]:
# Change 'month' column into datetime
flat_resale_17_23['month'] = pd.to_datetime(flat_resale_17_23['month'])

In [34]:
# Verify the changes
flat_resale_17_23['month'].dtype

dtype('<M8[ns]')

# 04. Find Mixed-Type Data

### 04.1 Flat Resale Data: Jan 1990 ~ Dec 1999

In [35]:
# Check for any mixed-type columns - no output means no mixed-type data
for col in flat_resale_90_99.columns.tolist():
    weird = (flat_resale_90_99[[col]].applymap(type) != flat_resale_90_99[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (flat_resale_90_99[weird]) > 0:
        print (col)

No unusual findings.

### 04.2 Flat Resale Data: Jan 2000 ~ Feb 2012

In [36]:
# Check for any mixed-type columns - no output means no mixed-type data
for col in flat_resale_00_12.columns.tolist():
    weird = (flat_resale_00_12[[col]].applymap(type) != flat_resale_00_12[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (flat_resale_00_12[weird]) > 0:
        print (col)

No unusual findings.

### 04.3 Flat Resale Data: Mar 2012 ~ Dec 2014

In [37]:
# Check for any mixed-type columns - no output means no mixed-type data
for col in flat_resale_12_14.columns.tolist():
    weird = (flat_resale_12_14[[col]].applymap(type) != flat_resale_12_14[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (flat_resale_12_14[weird]) > 0:
        print (col)

No unusual findings.

### 04.4 Flat Resale Data: Jan 2015 ~ Dec 2016

In [38]:
# Check for any mixed-type columns - no output means no mixed-type data
for col in flat_resale_15_16.columns.tolist():
    weird = (flat_resale_15_16[[col]].applymap(type) != flat_resale_15_16[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (flat_resale_15_16[weird]) > 0:
        print (col)

No unusual findings.

### 04.5 Flat Resale Data: Jan 2017 ~ Dec 2023

In [39]:
# Check for any mixed-type columns - no output means no mixed-type data
for col in flat_resale_17_23.columns.tolist():
    weird = (flat_resale_17_23[[col]].applymap(type) != flat_resale_17_23[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (flat_resale_17_23[weird]) > 0:
        print (col)

No unusual findings.

# 05. Data Accuracy

### 05.1 Flat Resale Data: Jan 1990 ~ Dec 1999

In [40]:
# Check the descriptive statistics of numerical data
flat_resale_90_99.describe()

,month,floor_area_sqm,lease_commence_date,resale_price
count,287196,287196.000000,287196.000000,287196.00000
mean,1996-05-19 04:51:40.154598528,93.351778,1983.206897,219541.67471
min,1990-01-01 00:00:00,28.000000,1967.000000,5000.00000
25%,1994-06-01 00:00:00,68.000000,1979.000000,127000.00000
50%,1996-11-01 00:00:00,91.000000,1984.000000,195000.00000
75%,1998-10-01 00:00:00,113.000000,1987.000000,298000.00000
max,1999-12-01 00:00:00,307.000000,1997.000000,900000.00000
std,NaN,27.361872,6.085632,128145.25346

No unusual findings.

### 05.2 Flat Resale Data: Jan 2000 ~ Feb 2012

In [41]:
# Check the descriptive statistics of numerical data
flat_resale_00_12.describe()

,month,floor_area_sqm,lease_commence_date,resale_price
count,369651,369651.000000,369651.000000,369651.000000
mean,2005-09-16 23:21:18.086627584,96.586204,1987.984659,281271.860617
min,2000-01-01 00:00:00,28.000000,1966.000000,28000.000000
25%,2002-07-01 00:00:00,73.000000,1981.000000,195000.000000
50%,2005-07-01 00:00:00,100.000000,1987.000000,263000.000000
75%,2008-12-01 00:00:00,115.000000,1997.000000,350000.000000
max,2012-02-01 00:00:00,297.000000,2012.000000,903000.000000
std,NaN,25.598886,9.122421,112118.967206

No unusual findings.

### 05.3 Flat Resale Data: Mar 2012 ~ Dec 2014

In [42]:
# Check the descriptive statistics of numerical data
flat_resale_12_14.describe()

,month,floor_area_sqm,lease_commence_date,resale_price
count,52203,52203.000000,52203.000000,5.220300e+04
mean,2013-05-27 14:30:29.274179328,96.203285,1989.512902,4.612147e+05
min,2012-03-01 00:00:00,31.000000,1966.000000,1.950000e+05
25%,2012-08-01 00:00:00,73.000000,1983.000000,3.700000e+05
50%,2013-05-01 00:00:00,95.000000,1988.000000,4.400000e+05
75%,2014-03-01 00:00:00,111.000000,1999.000000,5.250000e+05
max,2014-12-01 00:00:00,266.000000,2012.000000,1.088888e+06
std,NaN,24.984010,10.139550,1.225534e+05

No unusual findings.

### 05.4 Flat Resale Data: Jan 2015 ~ Dec 2016

In [43]:
# Check the descriptive statistics of numerical data
flat_resale_15_16.describe()

,month,floor_area_sqm,lease_commence_date,remaining_lease,resale_price
count,37153,37153.000000,37153.000000,37153.000000,3.715300e+04
mean,2015-12-28 08:18:19.195219712,97.020386,1990.920195,73.913116,4.368628e+05
min,2015-01-01 00:00:00,31.000000,1966.000000,48.000000,1.900000e+05
25%,2015-07-01 00:00:00,74.000000,1984.000000,66.000000,3.400000e+05
50%,2016-01-01 00:00:00,96.000000,1989.000000,72.000000,4.080000e+05
75%,2016-07-01 00:00:00,111.000000,2000.000000,83.000000,4.950000e+05
max,2016-12-01 00:00:00,280.000000,2013.000000,97.000000,1.150000e+06
std,NaN,24.198360,10.862330,10.885456,1.358052e+05

No unusual findings.

### 05.5 Flat Resale Data: Jan 2017 ~ Dec 2023

In [44]:
# Check the descriptive statistics of numerical data
flat_resale_17_23.describe()

,month,floor_area_sqm,lease_commence_date,resale_price
count,169168,169168.000000,169168.000000,1.691680e+05
mean,2020-09-01 15:59:23.908068096,97.280891,1995.860305,4.909790e+05
min,2017-01-01 00:00:00,31.000000,1966.000000,1.400000e+05
25%,2019-01-01 00:00:00,82.000000,1985.000000,3.650000e+05
50%,2020-11-01 00:00:00,93.000000,1996.000000,4.600000e+05
75%,2022-05-01 00:00:00,112.000000,2009.000000,5.830000e+05
max,2023-12-01 00:00:00,249.000000,2022.000000,1.500000e+06
std,NaN,24.020269,13.943537,1.698532e+05

No unusual findings.

# 06. Data Consistency

### 06.1 Flat Resale Data: Jan 1990 ~ Dec 1999

In [45]:
# A) town
flat_resale_90_99['town'].value_counts(dropna = False).sort_index()

town
ANG MO KIO         20477
BEDOK              27164
BISHAN              8332
BUKIT BATOK        16365
BUKIT MERAH        10610
BUKIT PANJANG       5615
BUKIT TIMAH          938
CENTRAL AREA        2492
CHOA CHU KANG       8655
CLEMENTI           11337
GEYLANG            10476
HOUGANG            15921
JURONG EAST         9049
JURONG WEST        19203
KALLANG/WHAMPOA     8712
LIM CHU KANG          64
MARINE PARADE       3332
PASIR RIS          10911
QUEENSTOWN          9774
SEMBAWANG             24
SENGKANG             125
SERANGOON           8527
TAMPINES           30682
TOA PAYOH          10942
WOODLANDS           9680
YISHUN             27789
Name: count, dtype: int64

No unusual findings.

In [46]:
# B) flat_type
flat_resale_90_99['flat_type'].value_counts(dropna = False).sort_index()

flat_type
1 ROOM                 827
2 ROOM                4140
3 ROOM              113102
4 ROOM               98521
5 ROOM               48206
EXECUTIVE            22121
MULTI GENERATION       279
Name: count, dtype: int64

No unusual findings.

In [47]:
# C) storey_range
flat_resale_90_99['storey_range'].value_counts(dropna = False).sort_index()

storey_range
01 TO 03    60965
04 TO 06    75455
07 TO 09    69393
10 TO 12    58442
13 TO 15    13692
16 TO 18     4391
19 TO 21     2609
22 TO 24     1713
25 TO 27      536
Name: count, dtype: int64

No unusual findings.

In [48]:
# D) flat_model
flat_resale_90_99['flat_model'].value_counts(dropna = False).sort_index()

flat_model
2-ROOM                    21
APARTMENT               9901
IMPROVED               73589
IMPROVED-MAISONETTE       44
MAISONETTE             12215
MODEL A                70381
MODEL A-MAISONETTE       982
MULTI GENERATION         279
NEW GENERATION         78898
PREMIUM APARTMENT          6
SIMPLIFIED             23258
STANDARD               17375
TERRACE                  247
Name: count, dtype: int64

As other datasets have flat models in titlecase form, we will change the flat models into titlecase form.

In [49]:
# D1) Change the values in 'flat_model' into titlecase form
flat_resale_90_99['flat_model'] = flat_resale_90_99['flat_model'].str.title()

In [50]:
# Verify the changes
flat_resale_90_99['flat_model'].value_counts(dropna = False).sort_index()

flat_model
2-Room                    21
Apartment               9901
Improved               73589
Improved-Maisonette       44
Maisonette             12215
Model A                70381
Model A-Maisonette       982
Multi Generation         279
New Generation         78898
Premium Apartment          6
Simplified             23258
Standard               17375
Terrace                  247
Name: count, dtype: int64

In [51]:
flat_resale_90_99.head()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price
0,1990-01-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,10 TO 12,31.0,Improved,1977,9000
1,1990-01-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,04 TO 06,31.0,Improved,1977,6000
2,1990-01-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,10 TO 12,31.0,Improved,1977,8000
3,1990-01-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,07 TO 09,31.0,Improved,1977,6000
4,1990-01-01,ANG MO KIO,3 ROOM,216,ANG MO KIO AVE 1,04 TO 06,73.0,New Generation,1976,47200

### 06.2 Flat Resale Data: Jan 2000 ~ Feb 2012

In [52]:
# A) town
flat_resale_00_12['town'].value_counts(dropna = False).sort_index()

town
ANG MO KIO         19743
BEDOK              24002
BISHAN              8038
BUKIT BATOK        17483
BUKIT MERAH        13309
BUKIT PANJANG      12294
BUKIT TIMAH          938
CENTRAL AREA        2470
CHOA CHU KANG      17587
CLEMENTI           10394
GEYLANG            10724
HOUGANG            21131
JURONG EAST         9952
JURONG WEST        28242
KALLANG/WHAMPOA    10368
MARINE PARADE       2963
PASIR RIS          13973
PUNGGOL             4229
QUEENSTOWN         11567
SEMBAWANG           6657
SENGKANG           11657
SERANGOON           9037
TAMPINES           30697
TOA PAYOH          12124
WOODLANDS          35935
YISHUN             24137
Name: count, dtype: int64

No unusual findings.

In [53]:
# B) flat_type
flat_resale_00_12['flat_type'].value_counts(dropna = False).sort_index()

flat_type
1 ROOM                 355
2 ROOM                3554
3 ROOM              114661
4 ROOM              142171
5 ROOM               81675
EXECUTIVE            27075
MULTI-GENERATION       160
Name: count, dtype: int64

No unusual findings.

In [54]:
# C) storey_range
flat_resale_00_12['storey_range'].value_counts(dropna = False).sort_index()

storey_range
01 TO 03    76806
04 TO 06    95136
07 TO 09    84673
10 TO 12    71215
13 TO 15    24521
16 TO 18     9018
19 TO 21     4209
22 TO 24     2521
25 TO 27     1032
28 TO 30      434
31 TO 33       31
34 TO 36       20
37 TO 39       23
40 TO 42       12
Name: count, dtype: int64

No unusual findings.

In [55]:
# D) flat_model
flat_resale_00_12['flat_model'].value_counts(dropna = False).sort_index()

flat_model
2-room                     16
Adjoined flat             799
Apartment               15274
Improved               100441
Improved-Maisonette        46
Maisonette               9839
Model A                106147
Model A-Maisonette        626
Model A2                 6696
Multi Generation          160
New Generation          71685
Premium Apartment       18300
Premium Maisonette         66
Simplified              22370
Standard                16894
Terrace                   292
Name: count, dtype: int64

No unusual findings.

### 06.3 Flat Resale Data: Mar 2012 ~ Dec 2014

In [56]:
# A) town
flat_resale_12_14['town'].value_counts(dropna = False).sort_index()

town
ANG MO KIO         2553
BEDOK              3436
BISHAN              932
BUKIT BATOK        2142
BUKIT MERAH        2133
BUKIT PANJANG      1737
BUKIT TIMAH          99
CENTRAL AREA        315
CHOA CHU KANG      2043
CLEMENTI           1306
GEYLANG            1519
HOUGANG            2667
JURONG EAST        1238
JURONG WEST        4391
KALLANG/WHAMPOA    1530
MARINE PARADE       403
PASIR RIS          1777
PUNGGOL            1438
QUEENSTOWN         1470
SEMBAWANG          1217
SENGKANG           3094
SERANGOON          1134
TAMPINES           3821
TOA PAYOH          1718
WOODLANDS          4502
YISHUN             3588
Name: count, dtype: int64

No unusual findings.

In [57]:
# B) flat_type
flat_resale_12_14['flat_type'].value_counts(dropna = False).sort_index()

flat_type
1 ROOM                 40
2 ROOM                581
3 ROOM              15372
4 ROOM              20150
5 ROOM              11845
EXECUTIVE            4194
MULTI-GENERATION       21
Name: count, dtype: int64

No unusual findings.

In [58]:
# C) storey_range
flat_resale_12_14['storey_range'].value_counts(dropna = False).sort_index()

storey_range
01 TO 03     9692
01 TO 05     2700
04 TO 06    11456
06 TO 10     2474
07 TO 09     9878
10 TO 12     8370
11 TO 15     1259
13 TO 15     3304
16 TO 18     1319
16 TO 20      265
19 TO 21      605
21 TO 25       92
22 TO 24      351
25 TO 27      183
26 TO 30       39
28 TO 30      115
31 TO 33       23
31 TO 35        2
34 TO 36       32
36 TO 40        7
37 TO 39       26
40 TO 42       11
Name: count, dtype: int64

From the storey range above, there are actually two types of range exist: 
- increment of 3 (eg. 1 to 3, 4 to 6, 7 to 9,...)
- increment of 5 (eg. 1 to 5, 6 to 10, 11 to 15,...)

Since other datasets have the storey range of increment of 3, rows with storey range of increment of 5 will be converted.

In [59]:
# C1) Add a new column 'row_id' to better identify and locate the affected rows 
flat_resale_12_14['row_id'] = flat_resale_12_14.index

In [60]:
flat_resale_12_14.head(10)

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,row_id
0,2012-03-01,ANG MO KIO,2 ROOM,172,ANG MO KIO AVE 4,06 TO 10,45.0,Improved,1986,250000.0,0
1,2012-03-01,ANG MO KIO,2 ROOM,510,ANG MO KIO AVE 8,01 TO 05,44.0,Improved,1980,265000.0,1
2,2012-03-01,ANG MO KIO,3 ROOM,610,ANG MO KIO AVE 4,06 TO 10,68.0,New Generation,1980,315000.0,2
3,2012-03-01,ANG MO KIO,3 ROOM,474,ANG MO KIO AVE 10,01 TO 05,67.0,New Generation,1984,320000.0,3
4,2012-03-01,ANG MO KIO,3 ROOM,604,ANG MO KIO AVE 5,06 TO 10,67.0,New Generation,1980,321000.0,4
5,2012-03-01,ANG MO KIO,3 ROOM,154,ANG MO KIO AVE 5,01 TO 05,68.0,New Generation,1981,321000.0,5
6,2012-03-01,ANG MO KIO,3 ROOM,110,ANG MO KIO AVE 4,01 TO 05,67.0,New Generation,1978,323000.0,6
7,2012-03-01,ANG MO KIO,3 ROOM,445,ANG MO KIO AVE 10,01 TO 05,67.0,New Generation,1979,325000.0,7
8,2012-03-01,ANG MO KIO,3 ROOM,476,ANG MO KIO AVE 10,11 TO 15,67.0,New Generation,1979,328000.0,8
9,2012-03-01,ANG MO KIO,3 ROOM,631,ANG MO KIO AVE 4,01 TO 05,67.0,New Generation,1985,330000.0,9

In [61]:
# C2) Create a list of storey range with increment of 5
list_storey_range_5 = ['01 TO 05', '06 TO 10', '11 TO 15', '16 TO 20', '21 TO 25', '26 TO 30', '31 TO 35', '36 TO 40']

In [62]:
# C3) Extract the rows with storey range of increment of 5 and store them into 'rows_storey_range_5'
rows_storey_range_5 = flat_resale_12_14.loc[flat_resale_12_14['storey_range'].isin(list_storey_range_5)][['row_id', 'storey_range']]

In [63]:
rows_storey_range_5.head(10)

   row_id storey_range
0       0     06 TO 10
1       1     01 TO 05
2       2     06 TO 10
3       3     01 TO 05
4       4     06 TO 10
5       5     01 TO 05
6       6     01 TO 05
7       7     01 TO 05
8       8     11 TO 15
9       9     01 TO 05

In [64]:
len(rows_storey_range_5)

6838

In [65]:
# C4) Randomly assign a storey number to the affected rows based on their existing storey range
# Create a list that contain the new assigned storey numbers above

list_storey_number = []

# Set a seed value to generate the same random numbers everytime we run the code
np.random.seed(4)

for x in rows_storey_range_5['storey_range']: 
     
    if x == '01 TO 05': 
        list_storey_number.append(np.random.randint(low = 1, high = 6))   # 1 is included, but 6 is not included
    
    elif x == '06 TO 10': 
        list_storey_number.append(np.random.randint(low = 6, high = 11))
    
    elif x == '11 TO 15': 
        list_storey_number.append(np.random.randint(low = 11, high = 16))
    
    elif x == '16 TO 20': 
        list_storey_number.append(np.random.randint(low = 16, high = 21))
    
    elif x == '21 TO 25': 
        list_storey_number.append(np.random.randint(low = 21, high = 26))
    
    elif x == '26 TO 30': 
        list_storey_number.append(np.random.randint(low = 26, high = 31))
    
    elif x == '31 TO 35': 
        list_storey_number.append(np.random.randint(low = 31, high = 36))
    
    elif x == '36 TO 40': 
        list_storey_number.append(np.random.randint(low = 36, high = 40))

In [66]:
len(list_storey_number)

6838

In [67]:
# C5) Create a new column 'storey_number' in 'rows_storey_range_5' and set it equal to 'list_storey_number'
rows_storey_range_5['storey_number'] = list_storey_number

In [68]:
rows_storey_range_5.head(10)

   row_id storey_range  storey_number
0       0     06 TO 10              8
1       1     01 TO 05              2
2       2     06 TO 10              6
3       3     01 TO 05              1
4       4     06 TO 10              8
5       5     01 TO 05              2
6       6     01 TO 05              3
7       7     01 TO 05              5
8       8     11 TO 15             12
9       9     01 TO 05              1

In [69]:
# Check the min and max storey number of each storey range
rows_storey_range_5.groupby('storey_range').agg({'storey_number': ['min', 'max', 'count']})

             storey_number
                       min max count
storey_range
01 TO 05                 1   5  2700
06 TO 10                 6  10  2474
11 TO 15                11  15  1259
16 TO 20                16  20   265
21 TO 25                21  25    92
26 TO 30                26  30    39
31 TO 35                32  35     2
36 TO 40                36  39     7

In [70]:
# C6) Create a new storey range based on the newly assigned storey numbers
list_new_storey_range = []

for x in rows_storey_range_5['storey_number']: 
    
    if (x >= 1) and (x <= 3): 
        list_new_storey_range.append('01 TO 03')
    
    elif (x >= 4) and (x <= 6): 
        list_new_storey_range.append('04 TO 06')
    
    elif (x >= 7) and (x <= 9): 
        list_new_storey_range.append('07 TO 09')
    
    elif (x >= 10) and (x <= 12): 
        list_new_storey_range.append('10 TO 12')
    
    elif (x >= 13) and (x <= 15): 
        list_new_storey_range.append('13 TO 15')
    
    elif (x >= 16) and (x <= 18): 
        list_new_storey_range.append('16 TO 18')
    
    elif (x >= 19) and (x <= 21): 
        list_new_storey_range.append('19 TO 21')
    
    elif (x >= 22) and (x <= 24): 
        list_new_storey_range.append('22 TO 24')
    
    elif (x >= 25) and (x <= 27): 
        list_new_storey_range.append('25 TO 27')
    
    elif (x >= 28) and (x <= 30): 
        list_new_storey_range.append('28 TO 30')
    
    elif (x >= 31) and (x <= 33): 
        list_new_storey_range.append('31 TO 33')
    
    elif (x >= 34) and (x <= 36): 
        list_new_storey_range.append('34 TO 36')
    
    elif (x >= 37) and (x <= 39): 
        list_new_storey_range.append('37 TO 39')
    
    elif (x >= 40) and (x <= 42): 
        list_new_storey_range.append('40 TO 42')

In [71]:
len(list_new_storey_range)

6838

In [72]:
# C7) Create a new column 'new_storey_range' in 'rows_storey_range_5' and set it equal to 'list_new_storey_range'
rows_storey_range_5['new_storey_range'] = list_new_storey_range

In [73]:
rows_storey_range_5.head(10)

   row_id storey_range  storey_number new_storey_range
0       0     06 TO 10              8         07 TO 09
1       1     01 TO 05              2         01 TO 03
2       2     06 TO 10              6         04 TO 06
3       3     01 TO 05              1         01 TO 03
4       4     06 TO 10              8         07 TO 09
5       5     01 TO 05              2         01 TO 03
6       6     01 TO 05              3         01 TO 03
7       7     01 TO 05              5         04 TO 06
8       8     11 TO 15             12         10 TO 12
9       9     01 TO 05              1         01 TO 03

In [74]:
# Check the min and max storey number of each new storey range
rows_storey_range_5.groupby('new_storey_range').agg({'storey_number': ['min', 'max', 'count']})

                 storey_number
                           min max count
new_storey_range
01 TO 03                     1   3  1599
04 TO 06                     4   6  1585
07 TO 09                     7   9  1474
10 TO 12                    10  12  1005
13 TO 15                    13  15   770
16 TO 18                    16  18   165
19 TO 21                    19  21   127
22 TO 24                    22  24    52
25 TO 27                    25  27    29
28 TO 30                    28  30    23
31 TO 33                    32  32     1
34 TO 36                    35  36     4
37 TO 39                    37  39     4

In [75]:
# C8) Replace the storey range of the affected rows in the main dataframe 'flat_resale_12_14' with the new storey range
for x in rows_storey_range_5['row_id'].tolist(): 
    
    flat_resale_12_14.loc[flat_resale_12_14['row_id'] == x, 'storey_range'] = rows_storey_range_5.loc[rows_storey_range_5['row_id'] == x]['new_storey_range']

In [76]:
# Verify the changes
flat_resale_12_14['storey_range'].value_counts(dropna = False).sort_index()

storey_range
01 TO 03    11291
04 TO 06    13041
07 TO 09    11352
10 TO 12     9375
13 TO 15     4074
16 TO 18     1484
19 TO 21      732
22 TO 24      403
25 TO 27      212
28 TO 30      138
31 TO 33       24
34 TO 36       36
37 TO 39       30
40 TO 42       11
Name: count, dtype: int64

Now the storey range are all with increment of 3.

In [77]:
# C9) Drop the 'row_id' column in 'flat_resale_12_14'
flat_resale_12_14.drop(columns = ['row_id'], inplace = True)

In [78]:
flat_resale_12_14.head()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price
0,2012-03-01,ANG MO KIO,2 ROOM,172,ANG MO KIO AVE 4,07 TO 09,45.0,Improved,1986,250000.0
1,2012-03-01,ANG MO KIO,2 ROOM,510,ANG MO KIO AVE 8,01 TO 03,44.0,Improved,1980,265000.0
2,2012-03-01,ANG MO KIO,3 ROOM,610,ANG MO KIO AVE 4,04 TO 06,68.0,New Generation,1980,315000.0
3,2012-03-01,ANG MO KIO,3 ROOM,474,ANG MO KIO AVE 10,01 TO 03,67.0,New Generation,1984,320000.0
4,2012-03-01,ANG MO KIO,3 ROOM,604,ANG MO KIO AVE 5,07 TO 09,67.0,New Generation,1980,321000.0

In [79]:
# D) flat_model
flat_resale_12_14['flat_model'].value_counts(dropna = False).sort_index()

flat_model
Adjoined flat             84
Apartment               2150
DBSS                      72
Improved               13744
Improved-Maisonette        6
Maisonette              1443
Model A                14430
Model A-Maisonette        75
Model A2                 792
Multi Generation          21
New Generation          9598
Premium Apartment       4514
Premium Maisonette         4
Simplified              3092
Standard                2144
Terrace                   33
Type S1                    1
Name: count, dtype: int64

No unusual findings.

### 06.4 Flat Resale Data: Jan 2015 ~ Dec 2016

In [80]:
# A) town
flat_resale_15_16['town'].value_counts(dropna = False).sort_index()

town
ANG MO KIO         1851
BEDOK              2442
BISHAN              685
BUKIT BATOK        1501
BUKIT MERAH        1365
BUKIT PANJANG      1398
BUKIT TIMAH          88
CENTRAL AREA        410
CHOA CHU KANG      1770
CLEMENTI            933
GEYLANG            1032
HOUGANG            1909
JURONG EAST         832
JURONG WEST        2888
KALLANG/WHAMPOA    1145
MARINE PARADE       225
PASIR RIS          1185
PUNGGOL            1550
QUEENSTOWN          971
SEMBAWANG          1014
SENGKANG           2619
SERANGOON           826
TAMPINES           2666
TOA PAYOH          1095
WOODLANDS          2599
YISHUN             2154
Name: count, dtype: int64

No unusual findings.

In [81]:
# B) flat_type
flat_resale_15_16['flat_type'].value_counts(dropna = False).sort_index()

flat_type
1 ROOM                 14
2 ROOM                348
3 ROOM              10021
4 ROOM              15190
5 ROOM               8735
EXECUTIVE            2840
MULTI-GENERATION        5
Name: count, dtype: int64

No unusual findings.

In [82]:
# C) storey_range
flat_resale_15_16['storey_range'].value_counts(dropna = False).sort_index()

storey_range
01 TO 03    7050
04 TO 06    8961
07 TO 09    8220
10 TO 12    7048
13 TO 15    3176
16 TO 18    1300
19 TO 21     514
22 TO 24     369
25 TO 27     189
28 TO 30     119
31 TO 33      53
34 TO 36      55
37 TO 39      54
40 TO 42      27
43 TO 45       8
46 TO 48       8
49 TO 51       2
Name: count, dtype: int64

No unusual findings.

In [83]:
# D) flat_model
flat_resale_15_16['flat_model'].value_counts(dropna = False).sort_index()

flat_model
2-room                        1
Adjoined flat                50
Apartment                  1422
DBSS                        205
Improved                   9511
Improved-Maisonette           4
Maisonette                 1036
Model A                   11143
Model A-Maisonette           70
Model A2                    576
Multi Generation              5
New Generation             6328
Premium Apartment          3526
Premium Apartment Loft        5
Premium Maisonette            2
Simplified                 1872
Standard                   1181
Terrace                      24
Type S1                     137
Type S2                      55
Name: count, dtype: int64

No unusual findings.

### 06.5 Flat Resale Data: Jan 2017 ~ Dec 2023

In [84]:
# A) town
flat_resale_17_23['town'].value_counts(dropna = False).sort_index()

town
ANG MO KIO          7034
BEDOK               9038
BISHAN              3131
BUKIT BATOK         6185
BUKIT MERAH         6498
BUKIT PANJANG       6295
BUKIT TIMAH          426
CENTRAL AREA        1386
CHOA CHU KANG       7713
CLEMENTI            3833
GEYLANG             4187
HOUGANG             8444
JURONG EAST         3466
JURONG WEST        11101
KALLANG/WHAMPOA     5077
MARINE PARADE       1063
PASIR RIS           5078
PUNGGOL            12593
QUEENSTOWN          4705
SEMBAWANG           4519
SENGKANG           14134
SERANGOON           3112
TAMPINES           11267
TOA PAYOH           5338
WOODLANDS          11958
YISHUN             11587
Name: count, dtype: int64

No unusual findings.

In [85]:
# B) flat_type
flat_resale_17_23['flat_type'].value_counts(dropna = False).sort_index()

flat_type
1 ROOM                 64
2 ROOM               2867
3 ROOM              39934
4 ROOM              71266
5 ROOM              42265
EXECUTIVE           12698
MULTI-GENERATION       74
Name: count, dtype: int64

No unusual findings.

In [86]:
# C) storey_range
flat_resale_17_23['storey_range'].value_counts(dropna = False).sort_index()

storey_range
01 TO 03    29809
04 TO 06    38867
07 TO 09    35504
10 TO 12    31643
13 TO 15    16181
16 TO 18     7631
19 TO 21     3247
22 TO 24     2341
25 TO 27     1402
28 TO 30      924
31 TO 33      485
34 TO 36      444
37 TO 39      392
40 TO 42      187
43 TO 45       56
46 TO 48       40
49 TO 51       15
Name: count, dtype: int64

No unusual findings.

In [87]:
# D) flat_model
flat_resale_17_23['flat_model'].value_counts(dropna = False).sort_index()

flat_model
2-room                       70
3Gen                         26
Adjoined flat               301
Apartment                  6372
DBSS                       2909
Improved                  41752
Improved-Maisonette          25
Maisonette                 4829
Model A                   58306
Model A-Maisonette          303
Model A2                   1944
Multi Generation             74
New Generation            21110
Premium Apartment         19257
Premium Apartment Loft       99
Premium Maisonette           14
Simplified                 6548
Standard                   4688
Terrace                      92
Type S1                     292
Type S2                     157
Name: count, dtype: int64

No unusual findings.

# 07. Data Duplicates

### 07.1 Flat Resale Data: Jan 1990 ~ Dec 1999

In [88]:
# Check if there are any full duplicates in the dataframe
flat_resale_90_99.duplicated().sum()

826

In [89]:
# Get the frequency table of the number of appearance for each unique row
flat_resale_90_99.groupby(flat_resale_90_99.columns.to_list()).size().value_counts()

1    285558
2       798
3        14
Name: count, dtype: int64

Since there is no transaction ID for each resale, it's hard to conclude that these duplicates are due to error. This is because multiple resales could be happened in the same flat, same storey range, within the same month, and transacted at the same price. Therefore, no action is needed.

### 07.2 Flat Resale Data: Jan 2000 ~ Feb 2012

In [90]:
# Check if there are any full duplicates in the dataframe
flat_resale_00_12.duplicated().sum()

513

In [91]:
# Get the frequency table of the number of appearance for each unique row
flat_resale_00_12.groupby(flat_resale_00_12.columns.to_list()).size().value_counts()

1    368637
2       494
3         3
4         3
5         1
Name: count, dtype: int64

Since there is no transaction ID for each resale, it's hard to conclude that these duplicates are due to error. This is because multiple resales could be happened in the same flat, same storey range, within the same month, and transacted at the same price.

In [92]:
# Further check the rows with more than 3 appearances

# 'as_index = False' is effectively SQL-style grouped output
flat_resale_00_12_groupby = flat_resale_00_12.groupby(flat_resale_00_12.columns.to_list(), as_index = False).size()

In [93]:
type(flat_resale_00_12_groupby)

pandas.core.frame.DataFrame

In [94]:
flat_resale_00_12_groupby.loc[flat_resale_00_12_groupby['size'] >= 4]

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,size
279528,2009-01-01,PASIR RIS,3 ROOM,5,CHANGI VILLAGE RD,04 TO 06,66.0,Improved,1981,177000.0,4
281442,2009-02-01,PASIR RIS,3 ROOM,5,CHANGI VILLAGE RD,01 TO 03,66.0,Improved,1981,177000.0,5
281447,2009-02-01,PASIR RIS,3 ROOM,5,CHANGI VILLAGE RD,04 TO 06,66.0,Improved,1981,177000.0,4
285995,2009-04-01,PASIR RIS,3 ROOM,5,CHANGI VILLAGE RD,04 TO 06,66.0,Improved,1981,177000.0,4

For the unique rows that come with 4 and 5 apperances, they are all from 5, Changi Village Road. From the Google Maps, we can see that this flat has 4 floors. The first floor are stalls selling food, groceries and other items. The second to forth floors are residential units. From the PropertyGuru website, there are a total of 75 units in this flat, which means each floor has 25 units. In this case, it is possible that 4 to 5 resales could be happened in this same flat, same storey range, within the same month, and transacted at the same price. Therefore, no action is needed. <br>
- Google Maps website: https://maps.app.goo.gl/kiCMueKkSCzLkeTP6 <br>
- PropertyGuru website: https://www.propertyguru.com.sg/singapore-property-listing/hdb/pasir-ris/changi-village-road_103875/5#:~:text=Car%20Park-,Buildings%20Details,-Building

### 07.3 Flat Resale Data: Mar 2012 ~ Dec 2014

In [95]:
# Check if there are any full duplicates in the dataframe
flat_resale_12_14.duplicated().sum()

246

In [96]:
# Get the frequency table of the number of appearance for each unique row
flat_resale_12_14.groupby(flat_resale_12_14.columns.to_list()).size().value_counts()

1    51711
2      246
Name: count, dtype: int64

Since there is no transaction ID for each resale, it's hard to conclude that these duplicates are due to error. This is because multiple resales could be happened in the same flat, same storey range, within the same month, and transacted at the same price. Therefore, no action is needed.

### 07.4 Flat Resale Data: Jan 2015 ~ Dec 2016

In [97]:
# Check if there are any full duplicates in the dataframe
flat_resale_15_16.duplicated().sum()

24

In [98]:
# Get the frequency table of the number of appearance for each unique row
flat_resale_15_16.groupby(flat_resale_15_16.columns.to_list()).size().value_counts()

1    37105
2       24
Name: count, dtype: int64

Since there is no transaction ID for each resale, it's hard to conclude that these duplicates are due to error. This is because multiple resales could be happened in the same flat, same storey range, within the same month, and transacted at the same price. Therefore, no action is needed.

### 07.5 Flat Resale Data: Jan 2017 ~ Dec 2023

In [99]:
# Check if there are any full duplicates in the dataframe
flat_resale_17_23.duplicated().sum()

281

In [100]:
# Get the frequency table of the number of appearance for each unique row
flat_resale_17_23.groupby(flat_resale_17_23.columns.to_list()).size().value_counts()

1    168606
2       281
Name: count, dtype: int64

Since there is no transaction ID for each resale, it's hard to conclude that these duplicates are due to error. This is because multiple resales could be happened in the same flat, same storey range, within the same month, and transacted at the same price. Therefore, no action is needed.

# 08. Missing Values

### 08.1 Flat Resale Data: Jan 1990 ~ Dec 1999

In [101]:
# Check the number of missing values in each column
flat_resale_90_99.isnull().sum()

month                  0
town                   0
flat_type              0
block                  0
street_name            0
storey_range           0
floor_area_sqm         0
flat_model             0
lease_commence_date    0
resale_price           0
dtype: int64

### 08.2 Flat Resale Data: Jan 2000 ~ Feb 2012

In [102]:
# Check the number of missing values in each column
flat_resale_00_12.isnull().sum()

month                  0
town                   0
flat_type              0
block                  0
street_name            0
storey_range           0
floor_area_sqm         0
flat_model             0
lease_commence_date    0
resale_price           0
dtype: int64

### 08.3 Flat Resale Data: Mar 2012 ~ Dec 2014

In [103]:
# Check the number of missing values in each column
flat_resale_12_14.isnull().sum()

month                  0
town                   0
flat_type              0
block                  0
street_name            0
storey_range           0
floor_area_sqm         0
flat_model             0
lease_commence_date    0
resale_price           0
dtype: int64

### 08.4 Flat Resale Data: Jan 2015 ~ Dec 2016

In [104]:
# Check the number of missing values in each column
flat_resale_15_16.isnull().sum()

month                  0
town                   0
flat_type              0
block                  0
street_name            0
storey_range           0
floor_area_sqm         0
flat_model             0
lease_commence_date    0
remaining_lease        0
resale_price           0
dtype: int64

### 08.5 Flat Resale Data: Jan 2017 ~ Dec 2023

In [105]:
# Check the number of missing values in each column
flat_resale_17_23.isnull().sum()

month                  0
town                   0
flat_type              0
block                  0
street_name            0
storey_range           0
floor_area_sqm         0
flat_model             0
lease_commence_date    0
remaining_lease        0
resale_price           0
dtype: int64

# 09. Export Data

### 09.1 Flat Resale Data: Jan 1990 ~ Dec 1999

In [106]:
flat_resale_90_99.shape

(287196, 10)

In [107]:
flat_resale_90_99.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'flat_resale_90_99 (checked).csv'))

### 09.2 Flat Resale Data: Jan 2000 ~ Feb 2012

In [108]:
flat_resale_00_12.shape

(369651, 10)

In [109]:
flat_resale_00_12.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'flat_resale_00_12 (checked).csv'))

### 09.3 Flat Resale Data: Mar 2012 ~ Dec 2014

In [110]:
flat_resale_12_14.shape

(52203, 10)

In [111]:
flat_resale_12_14.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'flat_resale_12_14 (checked).csv'))

### 09.4 Flat Resale Data: Jan 2015 ~ Dec 2016

In [112]:
flat_resale_15_16.shape

(37153, 11)

In [113]:
flat_resale_15_16.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'flat_resale_15_16 (checked).csv'))

### 09.5 Flat Resale Data: Jan 2017 ~ Dec 2023

In [114]:
flat_resale_17_23.shape

(169168, 11)

In [115]:
flat_resale_17_23.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'flat_resale_17_23 (checked).csv'))